Revit 2024 API
CompoundStructure.SetNumberOfShellLayers Method
 Sets the number of interior or exterior shell layers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void SetNumberOfShellLayers(
	ShellLayerType shellLayerType,
	int numLayers
)
Visual Basic
Public Sub SetNumberOfShellLayers ( _
	shellLayerType As ShellLayerType, _
	numLayers As Integer _
)
Visual C++
public:
void SetNumberOfShellLayers(
	ShellLayerType shellLayerType,
	int numLayers
)
Parameters
shellLayerType
Type: Autodesk.Revit.DB.ShellLayerType
 If ShellLayerType.Exterior set the number of exterior shell layers (or top shell layers for a roof, floor, or ceiling type). If ShellLayerType.Interior set the number of interior shell layers (or bottom shell layers for a roof, floor, or ceiling type).
numLayers
Type: System.Int32
 The number of layers to be in the specified shell.
Remarks
 There must be at least one core layer, i.e. one layer which is not a shell layer.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  Number of shell layers is negative. -or- A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.ArgumentsInconsistentException |  Too many shell layers: there must be at least one core layer.
See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace